### 📘 Lesson 3: Introduction to Pandas

<div style="display: flex; align-items: center; justify-content: space-between;">
  <div>
    <h3>Notebook Developers</h3>
    <ul>
      <li><strong>Dr. Fabrizio Finozzi</strong> - Big Data Software Developer</li>
      <li><strong>Priyesh Gosai</strong> - Energy Systems Modeler and Training Coordinator</li>
    </ul>
  </div>
  <div>
    <a href="https://openenergytransition.org/index.html">
      <img src="https://openenergytransition.org/assets/img/oet-logo-red-n-subtitle.png" height="60" alt="OET">
    </a>
  </div>
</div>

##### 🎯 Learning Objectives  

* Gain an understanding of Numpy and Pandas, including their purposes and applications.
* Learn to utilize key functions within these libraries.
* Engage in practical exercises to effectively apply and Pandas tools.

### Introduction to Pandas


---

**What is Pandas**

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language (primarly on top of NumPy). It enables also to process data as one would do with SQL.

**How to import Pandas**

In [41]:
import pandas as pd

**Pandas overview**



A Pandas `DataFrame` is a two-dimensional, size-mutable and potentially heterogeneous (it means it can contain different types of data) tabular data. Dataframes can be built from dictionaries, where the dictionary keys are the column names and the dictionary values are strings that contain the column values

In [42]:
df_from_dict = pd.DataFrame({"Name": ["Tom", "Paul", "John", "Sarah"], "Age": [31, 42, 12, 56], "Shoe-size": [35, 42, 36, 31]})

An alternative is to use only lists

In [43]:
data_list = [["Tom", 31, 35], ["Paul", 42, 42], ["John", 12, 36], ["Sarah", 56, 31]]
data_column_name = ["Name", "Age", "Shoe-size"]
df_from_list = pd.DataFrame(data_list, columns=data_column_name)

Data can be fed into a Pandas `DataFrame` from a file. Pandas supports several file formats, which can be found at this [link](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html). For example the syntax from an excel file would be `df_read_from_file = pd.read_excel(file_name, sheet_name = sheet_name)`.

**Pandas `Dataframe` attributes and methods**

Pandas offers built-in methods and attributes of the `DataFrame` class which are useful to describe the data contained in the dataframe. Given a `DataFrame` called `dataframe_name`:
- `dataframe_name.shape`: the attribute returns a tuple representing the dimensionality (number of rows and columns) of the DataFrame
- `dataframe_name.head(n)`: the method displays the first `n` rows of the dataframe
- `dataframe_name.tail(n)`: the method displays the last `n` rows of the dataframe
- `dataframename.sample(n)`: the method returns another dataframe, containing a random sample of `n` rows from the original dataframe. If no argument is passed, the method returns a dataframe with just one row. One can also execute `dataframe_name.sample(frac=0.1)`. This will return a dataframe with `10 %` of the rows from the original dataframe
- `dataframe_name.describe()`: the method returns a 8 × ncols dataframe. If `dataframe_name` contains numeric data, the method returns for each column, `count` (number of rows containing non-null values), `mean`, `std`, `min`, `max`, the `25 percentile`, `50 percentile` (the median) and `75 percentile`
- `dataframe_name.isna()`: the method returns a boolean same-sized dataframe, indicating if the values are `NA`. `NA` values, such as `None` or `numpy.NaN`, get mapped to `True`. Everything else gets mapped to `False`. Characters such as empty strings `" "` or `numpy.inf` are **not** considered `NA` values. The snippet `dataframe_name.isna().sum()` returns the number of rows in each column where `NA` values are present

In [44]:
df_from_list

    Name  Age  Shoe-size
0    Tom   31         35
1   Paul   42         42
2   John   12         36
3  Sarah   56         31

In [45]:
df_from_list.shape

(4, 3)

In [46]:
df_from_list.head(1)

  Name  Age  Shoe-size
0  Tom   31         35

In [47]:
df_from_list.tail(2)

    Name  Age  Shoe-size
2   John   12         36
3  Sarah   56         31

In [48]:
df_from_list.sample(1)

   Name  Age  Shoe-size
2  John   12         36

In [49]:
df_from_list.describe()

             Age  Shoe-size
count   4.000000   4.000000
mean   35.250000  36.000000
std    18.571932   4.546061
min    12.000000  31.000000
25%    26.250000  34.000000
50%    36.500000  35.500000
75%    45.500000  37.500000
max    56.000000  42.000000

In [50]:
df_from_list.isna()

    Name    Age  Shoe-size
0  False  False      False
1  False  False      False
2  False  False      False
3  False  False      False

**Accessing the columns of a Pandas `Dataframe`**

The column `column_name` of a DataFrame `dataframe_name` can be accessed as `dataframe_name[”column_name”]`. For example

In [51]:
df_from_list["Age"]

0    31
1    42
2    12
3    56
Name: Age, dtype: int64

In [52]:
print(type(df_from_list["Age"]))

<class 'pandas.core.series.Series'>

The snippet above returns a Pandas object called a `Series`. Where the `DataFrame` is (at least) a two-dimensional object, a `Series` is instead a one-dimensional object. One can say that a `DataFrame` is a *container* for several `Series`, that correspond to the `DataFrame` columns.

**Please note**: the Series contains only the data of the column. It does not contain the column name available in the `DataFrame` header.

#### Taking a slice of a Pandas `DataFrame`

It is also possible to extract some columns from a `DataFrame` and get a `DataFrame` as a result. This can be achieved as

In [53]:
df_age_from_list = df_from_list[["Age"]]

In [54]:
df_age_from_list

   Age
0   31
1   42
2   12
3   56

In [55]:
print(type(df_age_from_list))

<class 'pandas.core.frame.DataFrame'>

**Adding or dropping columns in a `DataFrame`**

The snippet below can be used to add a new column to an existing `DataFrame`

In [56]:
df_from_list["Country"]=["US", "DE", "UK", "IT"]
df_from_list

    Name  Age  Shoe-size Country
0    Tom   31         35      US
1   Paul   42         42      DE
2   John   12         36      UK
3  Sarah   56         31      IT

The snippet instead can be used to drop a column

In [57]:
df_from_list = df_from_list.drop("Country", axis=1)
df_from_list

    Name  Age  Shoe-size
0    Tom   31         35
1   Paul   42         42
2   John   12         36
3  Sarah   56         31

The snippet below remains valid also to drop a row. This can be achieved with `axis=0`.

**Further `DataFrame` methods**

It is possible to add new columns to an existing `DataFrame` named `dataframe_name` with the following methods:
- `dataframe_name.map()`: given a mapping dictionary, the method applies element-wise a certain mapping to a `Series` object (as a column)

In [58]:
df_from_list["Country"]=["US", "DE", "UK", "IT"]
df_from_list["Country_numeric_map"] = df_from_list["Country"].map({"US": 0.0, "DE": 1.0, "UK": 2.0})
df_from_list

    Name  Age  Shoe-size Country  Country_numeric_map
0    Tom   31         35      US                  0.0
1   Paul   42         42      DE                  1.0
2   John   12         36      UK                  2.0
3  Sarah   56         31      IT                  NaN

- `dataframe_name.replace`: it works as the `map` method, but it has the difference that if the `Series` contains a category not mapped in the mapping dictionary, the method simply carries over the unmapped category in the new column (instead of assigning a `NaN` to it)

In [59]:
df_from_list["Country_numeric_replace"] = df_from_list["Country"].replace({"US": 0.0, "DE": 1.0, "UK": 2.0})
df_from_list

    Name  Age  Shoe-size Country  Country_numeric_map Country_numeric_replace
0    Tom   31         35      US                  0.0                     0.0
1   Paul   42         42      DE                  1.0                     1.0
2   John   12         36      UK                  2.0                     2.0
3  Sarah   56         31      IT                  NaN                      IT

- `dataframe_name.apply()`: the method applies a function to all values within a Pandas `Series` or `DataFrame`. The applied function can be either built-in or custom
- `dataframe_name.applymap()`: the method applies a built-in or custom function element-wise to a `DataFrame` object
- `dataframe_name.iloc()` and `dataframe_name.loc()`: the methods are used to slice a `DataFrame` by filtering on columns and/or rows. `iloc` performs the slicing using indexes or index positions, while `loc` using labels or names

In [60]:
# iloc - filter the second row
df_from_list.iloc[[1]]

   Name  Age  Shoe-size Country  Country_numeric_map Country_numeric_replace
1  Paul   42         42      DE                  1.0                     1.0

Please note that `df_from_list.iloc[1]` would have returned a Pandas `Series` instead of a Pandas `DataFrame`. Furthermore

In [61]:
# iloc - filter the second column
df_from_list.iloc[:, 1]

0    31
1    42
2    12
3    56
Name: Age, dtype: int64

In [62]:
# iloc - filter just the second, the fourth and the fifth columns
df_from_list.iloc[:, [1,3,4]]

   Age Country  Country_numeric_map
0   31      US                  0.0
1   42      DE                  1.0
2   12      UK                  2.0
3   56      IT                  NaN

In [63]:
# loc - filter the second row
df_from_list.loc[[1]]

   Name  Age  Shoe-size Country  Country_numeric_map Country_numeric_replace
1  Paul   42         42      DE                  1.0                     1.0

Please note that `df_from_list.loc[1]` would have returned a Pandas `Series` instead of a Pandas `DataFrame`. Furthermore

In [64]:
# loc - filter the second column
df_from_list.loc[:, "Age"]

0    31
1    42
2    12
3    56
Name: Age, dtype: int64

In [65]:
# loc - filter just the second, the fourth and the fifth columns
df_from_list.loc[:, ["Age", "Country", "Country_numeric_map"]]

   Age Country  Country_numeric_map
0   31      US                  0.0
1   42      DE                  1.0
2   12      UK                  2.0
3   56      IT                  NaN

- `dataframe_name.rename()`: the method renames a column, by means of a mapping dictionary

In [66]:
df_from_list.rename(columns={"Age": "Age_renamed"})

,Name,Age_renamed,Shoe-size,Country,Country_numeric_map,Country_numeric_replace
0,Tom,31,35,US,0.0,0.0
1,Paul,42,42,DE,1.0,1.0
2,John,12,36,UK,2.0,2.0
3,Sarah,56,31,IT,NaN,IT

**Merging and aggregating  `DataFrame`**

The `merge` function in Pandas performs on `DataFrame` the equivalent operations of an SQL join. Given two dataframes, the merge happens along shared column/s that exist in both of them. The basic syntax is `pd.merge(df_a ,df_b ,how=”type_of_join”,on=”col_name”)`. The full documentation is available at this [link](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.merge.html).

Pandas allows to perform `groupby` operations. They involve grouping by a column, applying an aggregating function and combining the results. Given the following `DataFrame`

In [67]:
data_dictionary = {
    'Name': ['John', 'Paul', 'Tom', 'Bob', 'Ronan',
                    'Kirby', 'Sarah', 'Joe', 'Donald', 'Jeffrey'],
    'Department': ['Administration', 'Marketing', 'Technical', 'Technical', 'Marketing',
                          'Administration', 'Technical', 'Marketing', 'Technical', 'Administration'],
    'Employment Type': ['Full-time', 'Intern', 'Intern', 'Part-time', 'Part-time',
                               'Full-time', 'Full-time', 'Intern', 'Intern', 'Full-time'],
    'Salary': [12, 50, 700, 700, 550,
                      12, 1250, 600, 111, 12]}

# Create the DataFrame
df = pd.DataFrame(data_dictionary)
df

      Name      Department Employment Type  Salary
0     John  Administration       Full-time      12
1     Paul       Marketing          Intern      50
2      Tom       Technical          Intern     700
3      Bob       Technical       Part-time     700
4    Ronan       Marketing       Part-time     550
5    Kirby  Administration       Full-time      12
6    Sarah       Technical       Full-time    1250
7      Joe       Marketing          Intern     600
8   Donald       Technical          Intern     111
9  Jeffrey  Administration       Full-time      12

the snippet below groups column `Salary` by column `Department` and applies a `sum`

In [68]:
df.groupby("Department")["Salary"].sum()

Department
Administration      36
Marketing         1200
Technical         2761
Name: Salary, dtype: int64

or the snippet below groups column `Department` by column `Employment Type` and counts the occurences

In [69]:
df.groupby("Employment Type")["Department"].count()

Employment Type
Full-time    4
Intern       4
Part-time    2
Name: Department, dtype: int64

Data from Excel spreadsheets or CSV files can be imported into Python using Pandas

In [70]:
df_power_plant = pd.read_csv("data/powerplants.csv",index_col=0)

In [71]:
df_power_plant

,Name,Fueltype,Technology,Set,Country,Capacity,Efficiency,Duration,Volume_Mm3,DamHeight_m,StorageCapacity_MWh,DateIn,DateRetrofit,DateOut,lat,lon,EIC,projectID,bus
1,Koeberg,Nuclear,Steam Turbine,PP,ZA,1940.0,NaN,NaN,0.0,0.0,0.0,1984.0,1984.0,2034.0,-33.6746,18.43210,"{nan, nan}","{'GNPT': {'G500317', 'G500318'}, 'GEO': {'GEO-...",1560
2,Nkula,Hydro,Reservoir,PP,MW,100.0,NaN,NaN,0.0,0.0,0.0,1966.0,1966.0,2066.0,-15.5269,34.81920,{nan},"{'GHPT': {'G602462'}, 'GEO': {'GEO-40388'}, 'G...",312
3,Kapichira,Hydro,Reservoir,PP,MW,130.0,NaN,NaN,0.0,0.0,0.0,2000.0,2000.0,2100.0,-15.8954,34.75310,{nan},"{'GHPT': {'G602459'}, 'GEO': {'GEO-40390'}, 'G...",341
4,Zongo,Hydro,Run-Of-River,PP,CD,225.0,NaN,NaN,0.0,0.0,0.0,1955.0,1955.0,2055.0,-4.7823,14.90445,"{nan, nan}","{'GHPT': {'G601505', 'G601504'}, 'GEO': {'GEO-...",1518
5,Zilo,Hydro,Reservoir,PP,CD,108.0,NaN,NaN,0.0,0.0,0.0,1952.0,1952.0,2052.0,-10.4998,25.46310,{nan},"{'GHPT': {'G601501'}, 'GEO': {'GEO-42626'}, 'G...",2493
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
291,Caculo Cabaca,Hydro,Run-Of-River,PP,AO,2040.0,NaN,NaN,0.0,0.0,0.0,2024.0,2024.0,2124.0,-9.7296,14.81630,{nan},{'GHPT': {'G600012'}},37
292,Julius Nyerere,Hydro,Reservoir,PP,TZ,2115.0,NaN,NaN,0.0,0.0,0.0,2024.0,2024.0,2124.0,-7.8032,37.85110,{nan},{'GHPT': {'G603595'}},1464
293,Kafue Gorge Lower,Hydro,Reservoir,PP,ZM,750.0,NaN,NaN,0.0,0.0,0.0,2021.0,2021.0,2121.0,-15.8959,28.56010,{nan},{'GHPT': {'G604090'}},2399
294,Lauca,Hydro,Run-Of-River,PP,AO,2070.0,NaN,NaN,0.0,0.0,0.0,2017.0,2017.0,2117.0,-9.7449,15.12510,{nan},{'GHPT': {'G600017'}},37
295,Sombwe,Hydro,Reservoir,PP,CD,150.0,NaN,NaN,0.0,0.0,0.0,1971.0,1971.0,2071.0,-9.3877,26.93660,{nan},{'GHPT': {'G601503'}},291

### Exercise: Power Plant Data Manipulation

**Task 1: View the column names**

- Use the columns attribute to view the names of all the columns in the dataset

In [72]:
# Provide code here

**Task 2: Find Unique Options for 'Fueltype', 'Technology', and 'Country'**
- Use the `unique()` function to find and print the unique values in the following columns:
  - `Fueltype`
  - `Technology`
  - `Country`

**Task 3: Filter Data by Technology**
- Assume you want to filter the data for a technology called `'Solar'`.
- Write the code to filter the DataFrame and show all power plants using `'Solar'` technology.

In [73]:
# Provide code here

**Task 4: Count the Number of Power Plants with a Certain Fuel**
- Assume the fuel type is `'Coal'`.
- Write the code to count and print the number of power plants that use `'Coal'` as the fuel type.

In [74]:
# Provide code here

**Task 5: Calculate the Capacity of All Generators in a Country**
- Assume you want to calculate the total capacity of all power plants in `'South Africa'`.
- Write the code to sum and print the total capacity of the power plants located in `'South Africa'`.

In [75]:
# Provide code here

**Task 6: Change the Capacity of One Power Plant**
- Assume you want to change the capacity of a power plant named `'Plant A'` to `500 MW`.
- Write the code to update the capacity of `'Plant A'` to `500 MW`.

In [76]:
# Provide code here

**Task 7: Add a New Power Plant**
- Add a new power plant to the DataFrame from the dictionary `new_plant`

In [ ]:
new_plant = {
    'Name': 'New Plant',
    'Fueltype': 'Wind',
    'Technology': 'Wind Turbine',
    'Set': 'Set1',
    'Country': 'Germany',
    'Capacity': 100,
    'Efficiency': 0.35,
    'Duration': 30,
    'Volume_Mm3': 0,
    'DamHeight_m': 0,
    'StorageCapacity_MWh': 0,
    'DateIn': '2025-01-01',
    'DateRetrofit': None,
    'DateOut': None,
    'lat': 51.1657,
    'lon': 10.4515,
    'EIC': 'EIC001',
    'projectID': 'proj001',
    'bus': 'bus001'
}

In [77]:
# Provide code here

### Additional Resources

- [Pandas website](https://pandas.pydata.org/)

#### Answers

In [78]:
# 1. View the column names
print("Column names:")
print(df_power_plant.columns)

Column names:
Index(['Name', 'Fueltype', 'Technology', 'Set', 'Country', 'Capacity',
       'Efficiency', 'Duration', 'Volume_Mm3', 'DamHeight_m',
       'StorageCapacity_MWh', 'DateIn', 'DateRetrofit', 'DateOut', 'lat',
       'lon', 'EIC', 'projectID', 'bus'],
      dtype='object')

In [79]:
# 2. Find the unique options for 'Fueltype', 'Technology', 'Country'
print("\nUnique Fueltypes:")
print(df_power_plant['Fueltype'].unique())

print("\nUnique Technologies:")
print(df_power_plant['Technology'].unique())

print("\nUnique Countries:")
print(df_power_plant['Country'].unique())

Unique Fueltypes:
['Nuclear' 'Hydro' 'Hard Coal' 'CCGT' 'Oil' 'Bioenergy' 'Waste']

Unique Technologies:
['Steam Turbine' 'Reservoir' 'Run-Of-River' 'Pumped Storage' 'CCGT' nan]

Unique Countries:
['ZA' 'MW' 'CD' 'ZM' 'TZ' nan 'AO' 'MZ' 'BW' 'SZ' 'LS' 'ZW']

In [80]:
# 3. Basic code to filter the data by technology (assume a technology name)
technology_name = 'Solar'  # Example technology name
filtered_df = df_power_plant[df_power_plant['Technology'] == technology_name]
print(f"\nPower plants with {technology_name} technology:")
print(filtered_df)

Power plants with Solar technology:
Empty DataFrame
Columns: [Name, Fueltype, Technology, Set, Country, Capacity, Efficiency, Duration, Volume_Mm3, DamHeight_m, StorageCapacity_MWh, DateIn, DateRetrofit, DateOut, lat, lon, EIC, projectID, bus]
Index: []

In [81]:
# 4. Count the number of power plants with a certain fuel
fuel_type = 'Coal'  # Example fuel type
fuel_count = df_power_plant[df_power_plant['Fueltype'] == fuel_type].shape[0]
print(f"\nNumber of power plants using {fuel_type}: {fuel_count}")

Number of power plants using Coal: 0

In [82]:
# 5. Calculate the capacity of all generators in a country
country_name = 'South Africa'  # Example country
total_capacity = df_power_plant[df_power_plant['Country'] == country_name]['Capacity'].sum()
print(f"\nTotal capacity of power plants in {country_name}: {total_capacity} MW")

Total capacity of power plants in South Africa: 0.0 MW

In [83]:
# 6. Change the capacity of one of the power plants
# Let's assume we want to change the capacity of a specific power plant (identified by Name)
plant_name = 'Plant A'  # Example power plant name
new_capacity = 500  # New capacity in MW
df_power_plant.loc[df_power_plant['Name'] == plant_name, 'Capacity'] = new_capacity
print(f"\nUpdated capacity of {plant_name}: {new_capacity} MW")

Updated capacity of Plant A: 500 MW

In [84]:
# Task 7: Add a new power plant
new_plant = {
    'Name': 'New Plant',
    'Fueltype': 'Wind',
    'Technology': 'Wind Turbine',
    'Set': 'Set1',
    'Country': 'Germany',
    'Capacity': 100,
    'Efficiency': 0.35,
    'Duration': 30,
    'Volume_Mm3': 0,
    'DamHeight_m': 0,
    'StorageCapacity_MWh': 0,
    'DateIn': '2025-01-01',
    'DateRetrofit': None,
    'DateOut': None,
    'lat': 51.1657,
    'lon': 10.4515,
    'EIC': 'EIC001',
    'projectID': 'proj001',
    'bus': 'bus001'
}

# Convert the new plant dictionary to a DataFrame
new_plant_df = pd.DataFrame([new_plant])

# Concatenate the new plant to the existing DataFrame
df_power_plant = pd.concat([df_power_plant, new_plant_df], ignore_index=True)

# Print the last added row to confirm
print("\nNew power plant added:")
print(df_power_plant.tail(1))  # Display the last added row

New power plant added:
          Name Fueltype    Technology   Set  Country  Capacity  Efficiency  \
161  New Plant     Wind  Wind Turbine  Set1  Germany     100.0        0.35

     Duration  Volume_Mm3  DamHeight_m  StorageCapacity_MWh      DateIn  \
161      30.0         0.0          0.0                  0.0  2025-01-01

    DateRetrofit DateOut      lat      lon     EIC projectID     bus
161         None    None  51.1657  10.4515  EIC001   proj001  bus001

### 
---